# Clear Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpatialFieldManager..::..Clear Method
SpatialFieldManager Class See Also
---
Clear all analysis results managed by this manager object
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public void Clear()
```

Visual Basic
---
```text
Public Sub Clear
```

Visual C++
---
```text
public:
void Clear()
```

# See Also
SpatialFieldManager Class
Autodesk.Revit.DB.Analysis Namespace